In [0]:
import pandas as pd
import numpy as np

In [5]:
df = pd.DataFrame([('bird', 'Falconiformes', 389.0),
                    ('bird', 'Psittaciformes', 24.0),
                    ('mammal', 'Carnivora', 80.2),
                    ('mammal', 'Primates', np.nan),
                    ('mammal', 'Carnivora', 58)],
                   index=['falcon', 'parrot', 'lion', 'monkey', 'leopard'],
                   columns=('class', 'order', 'max_speed'))
display(df)

          class           order  max_speed
falcon     bird   Falconiformes      389.0
parrot     bird  Psittaciformes       24.0
lion     mammal       Carnivora       80.2
monkey   mammal        Primates        NaN
leopard  mammal       Carnivora       58.0

In [13]:
df.groupby('class').groups
#grouped = df.groupby('order', axis='columns')
#grouped = df.groupby(['class', 'order'])

{'bird': Index(['falcon', 'parrot'], dtype='object'),
 'mammal': Index(['lion', 'monkey', 'leopard'], dtype='object')}

In [14]:
arrays = [['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
           ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]
index = pd.MultiIndex.from_arrays(arrays, names=['first', 'second'])
df = pd.DataFrame({'A': [1, 1, 1, 1, 2, 2, 3, 3],
                    'B': np.arange(8)},
                   index=index)
df

              A  B
first second
bar   one     1  0
      two     1  1
baz   one     1  2
      two     1  3
foo   one     2  4
      two     2  5
qux   one     3  6
      two     3  7

In [15]:
df.groupby([pd.Grouper(level=1), 'A']).sum()
#df.groupby([pd.Grouper(level='second'), 'A']).sum()

          B
second A
one    1  2
       2  4
       3  6
two    1  4
       2  5
       3  7

In [16]:
df.groupby(['second', 'A']).sum()

          B
second A
one    1  2
       2  4
       3  6
two    1  4
       2  5
       3  7

In [17]:
df.groupby(['second','A']).aggregate(np.sum)

          B
second A
one    1  2
       2  4
       3  6
two    1  4
       2  5
       3  7

In [18]:
df = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar',
                          'foo', 'bar', 'foo', 'foo'],
                    'B': ['one', 'one', 'two', 'three',
                          'two', 'two', 'one', 'three'],
                    'C': np.random.randn(8),
                    'D': np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.766145  0.895304
1  bar    one -0.420674  0.459939
2  foo    two  1.229159  0.970908
3  bar  three  0.948682  1.412242
4  foo    two  0.345421 -0.485090
5  bar    two  2.384557 -0.461375
6  foo    one -0.720803  0.296716
7  foo  three  0.257278 -0.105797

In [25]:
df.groupby('A').C.std()

A
bar    1.402747
foo    0.724241
Name: C, dtype: float64